Revit 2027 API
FamilyTypeSet.Erase Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	FamilyType item
)
Public Overridable Function Erase (
	item As FamilyType
) As Integer
public:
virtual int Erase(
	FamilyType^ item
)
abstract Erase :
        item : FamilyType -> int
override Erase :
        item : FamilyType -> int
Parameters
item FamilyType
Return Value
Int32
See Also
Reference
FamilyTypeSet Class
Autodesk.Revit.DB Namespace